{
    "link": "https://timesofindia.indiatimes.com/sports/cricket/england-tour-of-india-2025/as-clean-a-ball-striking-as-ive-seen-jos-buttler-hails-abhishek-sharma/articleshow/117881976.cms",
    "content": "Jos Buttler hails Abhishek Sharma: 'As clean a ball striking as I've seen' | Cricket News - The Times of IndiaEditionININUSSign InTOIIND vs ENGScheduleToday's ePaperNewsSports NewsCricket News'As clean a ball striking as I've seen': Jos Buttler hails Abhishek SharmaTrendingD GukeshAbhishek SharmaYuvraj SinghJasprit BumrahChampions TrophyR PraggnanandhaaViswanathan AnandJos ButlerGautam GambhirSachin TendulkarD GukeshAbhishek SharmaYuvraj SinghJasprit BumrahChampions TrophyR PraggnanandhaaViswanathan AnandJos ButlerGautam GambhirSachin TendulkarD GukeshAbhishek SharmaYuvraj SinghJasprit BumrahChampions TrophyR PraggnanandhaaViswanathan AnandJos ButlerGautam GambhirSachin Tendulkar'As clean a ball striking as I've seen': Jos Buttler hails Abhishek SharmaTOI Sports Desk / TIMESOFINDIA.COM / Updated: Feb 3, 2025, 14:19 ISTShareAA+Text SizeSmallMediumLargeEngland captain Jos Buttler praised Abhishek Sharma for his magnificent 135 off 54 balls in India's 150-run win over England in the fifth T20I. Buttler acknowledged Sharma's clean ball striking and credited the Indian team for their remarkable performance. He mentioned the difficulty of stopping an on-fire player and appreciated England's effort despite the loss.  NEW DELHI: England captain Jos Buttler praised Abhishek Sharma for his incredible 54-ball 135 in India's 150-run victory in the fifth Twenty20 International in Mumbai. He called the record innings one of the best displays of \"clean ball striking.\" With 13 sixes, the most in an innings for any Indian player, and the second-fastest T20I century by an Indian hitter off 37 balls, Abhishek made history as he led the hosts to 247 for nine.\"Yeah, (we are) obviously disappointed (with the result), they (India) played a fantastic batting innings. I think credit to Abhishek Sharma, I thought that's as clean a ball striking as I've seen, I thought he played fantastically well,\" Buttler told the media after India recorded their second biggest T20I win by runs on Sunday.Buttler stated that his team had only two choices: either to go boom or bust. He denied that England were \"shell-shocked\" by Abhishek's assault on his bowlers.Also See: 2025 Champions Trophy | ICC Champions Trophy Fixtures 2025\"We always sit down and think what more could we have done or how we could have stopped him, but some days I think you have to give a lot of credit to the opposition, I thought he played brilliantly well,\" Buttler said.\"Shell-shocked's not quite the word, I think. It can be difficult sometimes when a player gets on a roll and they play as well as he did,\" Buttler said.\"Looking back at the last IPL, him and Travis Head were the same at the top of the order for Sunrisers (Hyderabad) and obviously he's brought that into India.\"\"He (Abhishek) played a brilliant innings and sometimes you want to credit the opposition. You always think of what more could you do, how could we get him out, how could we slow him down and, but yeah, credit to us for, you know, sticking in there and fighting back and keeping them down to 240 after the start they got,\" Buttler said.After the visitors were bowled out for 97 in 10.3 overs, with Phil Salt making a 23-ball 55, the England captain admitted that the pitch was still the same for his batters.\"I've played in a few games like this and it generally goes one of two ways, you either get actually somewhere near or you fall in a heap and today was that day,\" he said.\"The way Phil Salt went out there and struck the ball, it was obviously a really good wicket, you needed someone to go with him and one or two guys to catch fire and that's the way you're going to chase that down.\"Like I said, you either get quite close in games like this and surprise yourselves or it doesn't work but, no, we certainly won't change the way we want to play. We need to, you know, keep backing that, be even more committed and you're desperate to do well and execute that,\" he said.Buttler stated that following a 1-4 series loss to India, he would not want England to alter their style of play.\"We've had our moments actually in all the games bar the first one probably and today. We had moments in Chennai, Pune and obviously the game we won in Rajkot,\" he said.\"As we get more experienced, more committed to the style we want to play and the nuances of the game of how we're going to win those moments, then (we would) go on to win the match and win series,\" he added.Buttler added that Varun Chakravarthy, the spinner for India, was \"accurate\" during this series, taking 14 wickets.\"He's had a good series. He's been very accurate in his subtle variations and he's got a really good length, so he's done well,\" Buttler said.About the AuthorTOI Sports DeskThe TOI Sports Desk excels in a myriad of roles that capture the essence of live sporting events and deliver compelling content to readers worldwide. From running live blogs for India and non-India cricket matches to global spectacles featuring Indian talents, like the Chess World Cup final featuring Praggnanandhaa and the Badminton World Championships semifinal featuring HS Prannoy, our live coverage extends to all mega sporting events. We extensively cover events like the Olympics, Asian Games, Cricket World Cups, FIFA World Cups, and more. The desk is also adept at writing comprehensive match reports and insightful post-match commentary, complemented by stats-based articles that provide an in-depth analysis of player performances and team dynamics. We track news wires for key stories, conduct exclusive player interviews in both text and video formats, and file content from print editions and reporters. We keep track of all viral stories, trending topics and produce our own copies on the subjects. We deliver accurate, engaging, and up-to-the-minute sports content, round the clock.Read MoreEnd of ArticleFOLLOW US ON SOCIAL MEDIA Visual Stories   Previous2nd Test: India beat Bangladesh by seven wickets to sweep seriessports2nd Test, Day 4: India push for victory with T20-style battingsports2nd Test, Day 1: B'desh 107/3 vs India on rain-shortened opening daysportsAshwin shines as India hammer Bangladesh in Chennai Testsports1st Test, Day 3: India hold upper hand despite spirited Bangladesh chasesports1st Test, Day 2: India in box seat after Bumrah takes four-for vs B'deshsports1st Test, Day 1: Ashwin, Jadeja dig India out of trouble vs B'deshsportsFrance waves farewell to Paralympics with spectacular ceremonysportsNavdeep's gold, Simran's bronze take India's medal tally to 29sportsParis Paralympics: India's flag bearers for closing ceremonysports Next123 Photostories  ​5 yoga asanas that can stimulate hair growth​National parks in India that are perfect to visit with friends5 everyday morning habits to detox kidney and liver5 common desi foods that can silently increase sugar levelsCharu Asopa on being a single mother to Ziana and handling things on her own: Sometimes I feel lonely and directionless10 alternatives to butter that are healthy and do not increase cholesterol7 habits to help create long-lasting love and relationships5 reasons relationships fall apart even with deep love, as per psychologyFrom Ankita Lokande not charging fees for Manikarnika to Vicky Jain revealing the number of cars he owns; Elvish Yadav asks candid questions to the Laughter Chefs 2's duoExclusive - Bigg Boss 18 winner Karan Veer Mehra on battling alcoholism and his bond with Sushant Singh Rajput; says 'He entered my life and helped me find my way out'From reports of Mahira Sharma and cricketer Mohammed Siraj dating to Archana Puram Singh getting brutally injured: Top TV newsNumerology Predictions Today, February 01, 2025: Read your personalized forecast for numbers 1 to 9123Top Sports NewsSachin TendulkarGautam GambhirChampions Trophy TicketsR PraggnanandhaaViswanathan AnandJasprit BumrahTOP TRENDINGDak Prescott FianceBudget NewsTaylor SwiftLuka Doncic FatherNirmala SitharamanTerror Kingpin Joginder GyongDelhi Election 2025USAID Shut downDeepSeek AIVirat Kohli IPL CareerTired of too many ads?go ad free nowTrending StoriesIn SportsEntire WebsiteYuvraj Singh was the one to believe in me: Abhishek SharmaJasprit Bumrah update: India seamer reaches Bengaluru for scans and further assessmentExclusive | Why Viswanathan Anand withdrew from Freestyle Chess Grand Slam TourWill Rohit Sharma win another ICC trophy? Here's what the horoscope saysMichael Bevan inducted into Australian Cricket Hall of Fame'No. 1 favourite cricketer': Aamir Khan shares his admiration for Sachin Tendulkar - Watch'Main focus is winning the trophy ': Sam Curran eyes ILT20 title as Desert Vipers dominate league stageGautam Gambhir clears India's T20I approach: 'Want to get 250-260 regularly'Ranquelino's Indian Derby delight: Holds off Pyrite to claim stunning winDavis Cup: India return to Group 1 with 4-0 win over Togo'Kejriwal WagonR mein aaye, sweater pehne aur khambe pe chadh gaye': Rahul at Delhi rallyBrothers clash over father's funeral, nearly cut body in two in MPGovt puts more money in hands of middle class. Will they spend it?Budget session: Rahul Gandhi arrives in ParliamentNo Jack Daniel's, Bacardi, Jim Beam in Canada: US brands start coming off shelvesBumrah update: India seamer reaches Bengaluru for scansWill faith ‘trump’ uncertainty? ‘Visa temples’ give hope to H1-B applicantsMusk to Dell founder: 'Yay! Thanks for your support, Michael. This will ...'Cabbie drives car onto Karnataka's Tekal railway station, lands on tracksExclusive | Why Anand withdrew from Freestyle Chess GS TourTired of too many ads?go ad free nowExplore Every CornerAcross The GlobeCBSE Admit Card 2025Elon MuskRebecca LobachPete AlonsoDonald TrumpDak PrescottDC Plane CrashPeyton ManningTom BradyScott BorasPhyllis FongNBA Trade RumorParliament Budget SessionBudget Tax Rules for NRINew Income Tax SlabsAyodhya Dalit Woman MurderFox Reporter Erin AndrewRoyal Rumble 2025 Winners ListNew Tax Regime vs Old Tax RegimeISRO SatelliteMumbai RapeMicrosoft LayoffStock Market TodayMatthew Stafford WifeTaylor SwiftI Meaning in Apple ProductsMichael Jordan SonAndy JassyICC Champions Trophy 2025 ScheduleBank Holidays 2025About usCreate Your Own AdTerms of Use and Grievance Redressal Policy Privacy policyAdvertise with usRSSNewsletterFeedbackePaperSitemapArchivesFOLLOW US ONOther Times Group News SitesThe Economic TimesHindi Economic TimesNavbharat TimesMaharashtra TimesVijaya KarnatakaTelugu SamayamTamil SamayamMalayalam SamayamI am GujaratTimesPointsIndiatimesBrand CapitalEducation TimesTimes FoodMumbai MirrorBangalore MirrorIndiaTimes BanglaHindi PodcastPopular CategoriesHeadlinesSports NewsBusiness NewsIndia NewsWorld NewsBollywood NewsHealth+ TipsIndian TV ShowsCelebrity PhotosTechnology NewsHot on the WebSky Force Box Office CollectionAshneer GroverGovind NamdevPushpa 2 Box Office CollectionGrammy AwardsWinner ListMamta KulkarniKaroline LeavittsWalking BenefitsPumpkin SeedsPrince HarryTop TrendsCBSE Admit CardD GukeshJasprit BumrahPayton ManningChampions Trophy India Match TicketsBlackhawk PilotUnited Airlines Plane FireDak Prescott FianceBudget 2025 NRI Tax RulesTrump TariffElon MuskBudget NRI Tax RulesMatthew StaffordJos ButtlerWWE PPV 2025 ScheduleKarnataka Sexual AssaultJa MorantLive Cricket ScoreTrending TopicsGrammy Awards 2025 Live UpdateEmergency Box Office CollectionSalman KhanKeerthy SureshBeetroot Chickpea KebabsValentines Day Week ListDeva Box Office CollectionBasan Panchami WishesUnion Budget 2025Udit NarayanKruger National ParkFebruary 2025 Health PredictionsFebruary 2025 Wealth PredictionsFebruary 2025 Career PredictionsFebruary 2025 Love PredictionsIbrahim Ali KhanRohan KhaunteGujarat School RapeRajasthan High CourtHarpreet Kaur BablaLiving and entertainmentETimesTravel DestinationsCricbuzz.comTVLifestyleNewspaper SubscriptionFood NewsTimes PrimeWhats HotServicesCouponDuniaTechGigTimesJobsBollywood NewsTimes MobileGadgetsWork with UsColombiaLatest NewsPoliticians have right to distribute wealth only if they are capable of create wealth: CM Chandrababu NaiduIncome Tax slabs 2025-26: How you can pay ZERO tax with Rs 13.7 lakh salary under new income tax regimeDid Allu Aravind take a subtle dig at Ram Charan's 'Game Changer' failure?Bitcoin suffers steep decline as tariff war tensions rise: ReportSamsung S25: Five features that set a new standard'Never flying Indigo again': Delhi doctor has 'nightmare' experience over pre-booked mealKate Middleton found solace at THIS place during her cancer treatment, it's NOT a royal houseWhy is China clamping down on scammers in Southeast Asia?World's most expensive cow sold for $4.8 million6 things one should eat when they start feeling sickLauren Graham reflects on her early career and first TV role; read deets'Arvind Kejriwal WagonR mein aaye, sweater pehne aur khambe pe chadh gaye': Rahul Gandhi at Delhi rallyAt least 15 killed in car bomb explosion in northern SyriaJeopardy! contestant Mehal Shah loses big over a small spelling mistake'As clean a ball striking as I've seen': Jos Buttler hails Abhishek SharmaBudget Goodwill, An Important Balance Sheet ItemSyria's first female football coach hoping for new eraSri Lankan navy arrests 10 Indian fishermen for poaching in territorial watersCopyright © 2025 Bennett, Coleman & Co. Ltd. All rights reserved. For reprint rights: Times Syndication ServiceDo Not Sell or Share My Personal Information "
}