[
    {
        "title": "Sports News Today Live Updates on February 4, 2025: Nagpur Police mistakes Indian support staff as fan, allows entry after journos shout ‘arey, coach hai wo’: Viral video | Mint",
        "link": "https://www.livemint.com/sports/latest-sports-news-on-february-4-2025-live-updates-11738644201181.html",
        "content": "Sports News Today highlights on February 4, 2025: Nagpur Police mistakes Indian support staff as fan, allows entry after journos shout ‘arey, coach hai wo’: Viral video | Mint Explore Sign in e-paper Subscribe Sign In Wednesday, 5 February 2025 Stocks Mutual Funds News Home Budget 2025 Markets News Premium Companies Money Latest News Personal Loan Technology Mint Hindi In Charts All Companies Technology Markets Money MyMint Mutual Funds Insurance Auto Industry Personal Finance Hello User Sign in Sign Out My Account My Account Subscribe My Watchlist Newsletters My Vouchers Notifications My Reads For You View Less - View More + Data Insights Market Dashboard Bullion Gold Silver Fuel Petrol Diesel Commodities Gold GoldM Aluminum Menthaoil Silver SilverMIC GoldPetal Natural Gas Copper Zinc SilverM CrudeOil GoldGinuea Lead CryptoCurrencies View Less - View More + Top Sections Today's News India News World News US News Today Budget 2025 Economy Money News Personal Finance Q&A Opinion Company Business News IPO News Start-ups Company Results Top Company Leader Stock Market News Stock Markets Commodity News Mark To Market IPO News Live Blog personal loan personal loan emi calculator Personal Loan Interest Rate Personal Loan Eligibility Business Loan Instant Loan Election Results 2025 Assembly Elections 2024 Indian Industry Analysis Banking News Infotech News Infrastructure Agriculture Manufacturing Energy News Retail News Auto News Sports News Opinion Views Columns Technology News Gadgets Tech Reviews App News Politics News Lounge Sports News IPL 2025 IPL Points Table 2025 IPL 2025 Orange Cap IPL 2025 Purple Cap IPL Match Today | IPL 2024 Schedule Education News Today View Less - View More + Premium Offerings e-paper WSJ Economist MyMint Mint Premium View Less - View More + Tools and Calculators IFSC Code Finder Income Tax Calculator SIP Calculator EMI Calculator Home Loan EMI Calculator Car Loan EMI NPS Calculator View Less - View More + MultiMedia Collections Videos WebStories Photo Gallery Podcasts View Less - View More + More From Mint Mint Genie Mint Lounge Mint Hindi Explore Mint About Us Print Subscription Mint Authors Terms of Use Disclaimer Mint Code Code of ethics Cookie Policy Privacy Policy Subscriber - Terms of Use SITEMAP Contact Us Mint Apps View Less - View More + Copyright © HT Digital Streams Limited All Rights Reserved. Gainers & Losers Top Gainers Top Losers Larsen & Toubro share price 3,443.60 4.76% Indusind Bank share price 1,048.10 3.50% Tata Motors share price 710.70 3.38% Reliance Industries share price 1,286.00 3.28% Ultratech Cement share price 11,484.45 2.78% Nestle India share price 2,298.20 -0.81% Maruti Suzuki India share price 13,105.00 -0.23% Tech Mahindra share price 1,652.75 -0.11% Hindustan Unilever share price 2,439.90 -0.06% Active Stocks Tue Feb 04 2025 15:59:54 Tata Motors share price 710.70 3.38% Tata Steel share price 133.40 1.14% State Bank Of India share price 779.20 2.39% Power Grid Corporation Of India share price 285.75 0.65% Wipro share price 316.25 0.88% Business News / Sports / Sports News Today highlights on February 4, 2025: Nagpur Police mistakes Indian support staff as fan, allows entry after journos shout ‘arey, coach hai wo’: Viral video Back Share Via Sports News Today highlights on February 4, 2025: Nagpur Police mistakes Indian support staff as fan, allows entry after journos shout ‘arey, coach hai wo’: Viral video 8 min read . Updated: 04 Feb 2025, 07:04 PM IST Livemint Sports News Today highlights on February 4, 2025: Stay up-to-date with the latest in sports, from cricket series and hockey tournaments to badminton championships and beyond. We bring you highlights, player performances, and expert analysis across major sports. With real-time updates on match results, league standings, and standout moments, you’ll never miss a key play or turning point. Premium Sports News Today Live Updates: Nagpur Police mistakes Indian support staff as fan, allows entry after journos shout ‘arey, coach hai wo’: Viral video (AP) Read Full Story Sports News Today highlights: In the dynamic world of sports, every match and series brings fresh excitement. Our Sports News offers real-time updates and in-depth coverage of cricket series, hockey showdowns, and badminton tournaments, bringing you closer to the games you love. From thrilling last-ball finishes in cricket to high-stakes hockey matches and intense badminton rallies, we deliver insights, key moments, and player achievements. Our goal is to keep you connected to the latest action, whether it’s a league championship, an international series, or a standout individual performance, so you’re always in the know on the biggest stories in sports. Disclaimer: This is an AI-generated live blog and has not been edited by LiveMint staff. 04 Feb 2025, 07:04:09 PM IST Cricket News Today Live: Nagpur Police mistakes Indian support staff as fan, allows entry after journos shout ‘arey, coach hai wo’: Viral video Raghavendra Dwivedi i"
    },
    {
        "title": "Not good for anyone, says SC, slams politicisation of sports administration",
        "link": "https://www.thehindu.com/news/national/not-good-for-anyone-says-sc-slams-politicisation-of-sports-administration/article69179852.ece",
        "content": "Not good for anyone, says SC, slams politicisation of sports administration - The Hindu /> February 4, 2025 e-Paper LOGIN Account FREE TRIAL Subscribe GIFT FRONT PAGE Search Live Now Agriculture Books SECTION Books TOPICS Hindi Belt NEWSLETTER The Hindu On Books Books of the week, reviews, excerpts, new titles and features. SEE ALL NEWSLETTERS Business SECTION Business Agri-Business Economy Industry Markets Budget Children Cities SECTION Cities Bengaluru Chennai Coimbatore Delhi Hyderabad Kochi Kolkata Kozhikode Madurai Mangaluru Mumbai Puducherry Thiruvananthapuram Tiruchirapalli Vijayawada Visakhapatnam Data SECTION Data TOPICS Data Point Podcast NEWSLETTER Data Point Decoding the headlines with facts, figures, and numbers SEE ALL NEWSLETTERS Ebook Education SECTION Education Careers Colleges Schools Elections Entertainment SECTION Entertainment Art Dance Movies Music Reviews Theatre NEWSLETTER First Day First Show News and reviews from the world of cinema and streaming. SEE ALL NEWSLETTERS Environment Food SECTION Food Dining Features Guides Recipes TOPICS Good Health Hunting Health SECTION Health TOPICS Monkeypox NEWSLETTER Health Matters Ramya Kannan writes to you on getting to good health, and staying there SEE ALL NEWSLETTERS Life & Style SECTION Life & Style Fashion Fitness Homes and gardens Luxury Motoring Travel News SECTION News India World States Cities TOPICS Ground Zero Spotlight NEWSLETTER The View From India Looking at World Affairs from the Indian perspective. SEE ALL NEWSLETTERS Opinion SECTION Opinion Editorial Cartoon Columns Comment Interview Lead Letters Open Page Corrections & Clarifications Real Estate Science SECTION Science TOPICS ISRO Question Corner NEWSLETTER Science For All The weekly newsletter from science writers takes the jargon out of science and puts the fun in! SEE ALL NEWSLETTERS Society SECTION Society Faith History & Culture Sport SECTION Sport Cricket Football Hockey Tennis Athletics Motorsport Races Other Sports TOPICS Between Wickets Specials States SECTION States Andhra Pradesh Karnataka Kerala Tamil Nadu Telangana Andaman and Nicobar Islands Arunachal Pradesh Assam Bihar Chandigarh Chhattisgarh Daman, Diu, Dadra and Nagar Haveli Goa Gujarat Haryana Himachal Pradesh Jammu and Kashmir Jharkhand Lakshadweep Ladakh Madhya Pradesh Maharashtra Manipur Meghalaya Mizoram Nagaland Odisha Other States Punjab Rajasthan Sikkim Tripura Uttar Pradesh Uttarakhand West Bengal TOPICS Decode Karnataka Focus Tamil Nadu NEWSLETTER Karnataka Today Your daily dose of news highlights from Karnataka SEE ALL NEWSLETTERS Technology SECTION Technology Gadgets Internet NEWSLETTER Today's Cache Your download of the top 5 technology stories of the day. SEE ALL NEWSLETTERS Visual Story Brandhub Connect with us February 4, 2025 e-Paper Search for topics, people, articles... India World Movies Sport Data Health Opinion Science Delhi Elections Premium Videos Podcast Photos Crossword Newsletter Events Lit for Life The Huddle Home News India Not good for anyone, says SC, slams politicisation of sports administration Office-bearers of sports associations must be genuine people with a sports background and such people should be given the independence, space and respect due to them, the court said Updated - February 04, 2025 08:35 pm IST - NEW DELHI Krishnadas Rajagopal Copy link Email Facebook Twitter Telegram LinkedIn WhatsApp Reddit READ LATER Remove SEE ALL PRINT Supreme Court directed the Centre to ensure the participation of the women’ kabaddi team at the Senior Asian Kabaddi Championship hosted by Iran from February 20-25. | Photo Credit: Sushil Kumar Verma Deprecating the politicisation of sports administration and the stranglehold of former judges and bureaucrats over sports bodies in the country, the Supreme Court on Tuesday (February 4, 2025) directed the Centre to ensure the participation of the women’ kabaddi team at the Senior Asian Kabaddi Championship hosted by Iran from February 20-25. “We deprecate the practice of former judges or bureaucrats continuing as administrators. That is not good for anyone,” a Bench of Justices Surya Kant and N. Kotiswar Singh observed. Democratic values have to be restored in sports administration, Justice Kant said. Office-bearers of sports associations must be genuine people with a sports background. Such people should be given the independence, space and respect due to them, the court noted. “All sports associations in which sportspersons have come forward [to administer] have improved a lot,” Justice Kant said. The court was hearing a petition filed by two national kabaddi players, Priyanka and Pooja, who sought a direction to the Amateur Kabaddi Federation of India (AKFI), a body recognised by the Sports Ministry, to send the women’s team to Iran where they have a shot at the gold medal. The petition, represented by senior advocate K. Parameshwar, said the AKFI had lost its affiliation to the International Kabaddi Federation (IKF), leaving the team’s "
    },
    {
        "title": "Ahmedabad gets a budget-friendly sports activity centre",
        "link": "https://english.gujaratsamachar.com/news/gujarat/ahmedabad-gets-a-budget-friendly-sports-activity-centre",
        "content": "Ahmedabad gets a budget friendly sports activity centre E PAPER CLASSIFIED GUJARATI Search 4th February 2025 | 6:00 PM Gujarat India NRI News Entertainment Sports Lifestyle & Fashion Health Business World Science & Technology VIDEO GUJARATI E-PAPER SEARCH Gujarat Samachar Gujarat Cities Ahmedabad Ahmedabad gets a budget-friendly sports activity centre Updated: Feb 4th, 2025 Amdavadis who found it difficult to enrol in clubs or expensive sports facilities in the city have an affordable place now to channelise their physical energy. The Amdavad Municipal Corporation (AMC) has inaugurated a new sports activity centre under the CIMS flyover on Science City Road, which provides residents with an affordable space to engage in various sports. This initiative aims to encourage fitness and recreation while offering an economical alternative to expensive private sports facilities. Timings, facilities & convenience The centre will remain open from 7 am to 2 am, with bookings available until 10 pm. To enhance user convenience, the centre is equipped with changing rooms for both men and women and offers free parking for visitors. The facility offers multiple sports options at significantly lower prices compared to private venues. The available sports and their rates include: – Air Hockey: ₹80 per session (2 players) – Table Tennis: ₹200 per hour (2 players) – Chess & Carrom: ₹200 per hour (2 players & 4 players, respectively) – Foosball: ₹250 per hour (2 players) – Box Cricket: ₹700 per hour (up to 12 players) – Pickleball: ₹500 per hour (4 players) – Basketball: ₹400 per hour (12 players) – Pool Table: ₹350 per session (2 players) Coaching for aspiring athletes In addition to casual play, AMC will soon introduce coaching programmes for select sports at subsidised rates: –Table Tennis & Chess: ₹700 per month (45-minute sessions) – Pickleball & Basketball: ₹1,000 per month (45-minute sessions) An indoor combo package will also be available for those opting for multiple sports. More centres in the near future Following the launch of the CIMS overbridge centre, AMC plans to construct nine more such sports activity centres at different locations across the city. The next facility is set to be built in the Sola area. Beyond sports, the centre features a food court, making it attractive for families and fitness enthusiasts. With its budget-friendly pricing and modern amenities, the new AMC sports activity centre is sure to attract those looking for easy-on-the-pocket recreation in Ahmedabad. Also read: AMC to build sports centres under eight flyovers Tags : Ahmedabad sports-activity-centre budget-friendly-sports-centre CIMS-flyover Science-City-Road fitness recreation Ahmedabad-News AMC CATEGORIES CITY NEWS About Us Contact Us Sitemap Terms and Conditions Cookie Policy Privacy Policy Advertise with us Feedback © All Rights Reserved 2025 GujaratSamachar.com"
    },
    {
        "title": "Ishant Sharma Attends Adani International School's Annual Sports Day",
        "link": "https://sports.ndtv.com/cricket/ishant-sharma-attends-adani-international-schools-annual-sports-day-7630293",
        "content": "Ishant Sharma Attends Adani International School's Annual Sports Day | Cricket News NDTV WORLD PROFIT हिंदी SPORTS MOVIES FOOD LIFESTYLE HEALTH SWASTH TECH GAMES BIG BONUS SHOPPING APPS Don't Miss Lewis Hamilton Unharmed After Crashing During Ferrari Barcelona Test Carlos Alcaraz Says Jannik Sinner Is The Man To Beat In Men's Tennis Spanish Football Still Mired In Scandal As Luis Rubiales Trial Begins WWE Scandal: Brock Lesnar Named In Lawsuit Against Vince McMahon ENG Select Languages हिंदी | Hindi Cricket Football Webstories Formula 1 Tennis Golf Badminton Kabaddi NBA Boxing Athletics Chess Swimming Shooting Wrestling Table tennis Othersports Login Dark / Light mode Ishant Sharma Attends Adani International School's Annual Sports Day facebook twitter WhatsApp Settings Change Font Size A A Change Language हिंदी | Hindi Focus on Story Select Language Languages हिंदी | Hindi Dark / Light mode Search Featured Links Champions Trophy 2025 CT Schedule EPL Table EPL Schedule Featured Sports Cricket Football Formula 1 Tennis Hockey Golf Badminton More Sports Kabaddi NBA Boxing Athletics Chess Swimming Shooting Wrestling Table tennis Othersports More from NDTV NDTV Business Hindi Movies Cricket Health Food Tech Auto Apps Trains Art Cricket Scores Series All Series Ranji Trophy India vs England 2025 Women's Premier League 2025 ICC Champions Trophy 2025 IPL 2025 England vs India, 2025 Fixtures Results News Photos Videos Features Teams More Players Venues ICC Rankings Test Championship arrow-down reddit snapchat twitter facebook comments email printer search bell top-nav reddit-fill snapchat-fill twitter-fill facebook-fill share whatsapp-fill bookmark arrow-rgt arrow-next arrow-up refresh close link cog star book zap cricket football tennis formula-1 badminton hockey golf boxing ndtv-n check left-arrow right-arrow Live Cricket Matches Cricket Matches Football Matches All Matches India Matches T20 WC 2024 Football Matches Cricket Matches Football Matches All Matches ISL EPL All Matches Cricket Matches Football Matches All Matches India Matches T20 WC 2024 1st ODI, England in India, 3 ODI Series, 2025 at Nagpur, Feb 6, 2025 notify notify India England Thu, Feb 6, 2025 - 1:30 PM IST 2nd ODI, England in India, 3 ODI Series, 2025 at Cuttack, Feb 9, 2025 notify notify India England Sun, Feb 9, 2025 - 1:30 PM IST 3rd ODI, England in India, 3 ODI Series, 2025 at Ahmedabad, Feb 12, 2025 notify notify India England Wed, Feb 12, 2025 - 1:30 PM IST 5th T20I, England in India, 5 T20I Series, 2025 at Mumbai, Feb 2, 2025 India 247/9 (20.0) England 97 (10.3) India beat England by 150 runs 4th T20I, England in India, 5 T20I Series, 2025 at Pune, Jan 31, 2025 India 181/9 (20.0) England 166 (19.4) India beat England by 15 runs 3rd T20I, England in India, 5 T20I Series, 2025 at Rajkot, Jan 28, 2025 India 145/9 (20.0) England 171/9 (20.0) England beat India by 26 runs Sports Home Cricket News Ishant Sharma Attends Adani International Schools Annual Sports Day Story Progress Back to home Ishant Sharma Attends Adani International School's Annual Sports Day Star India cricketer Ishant Sharma attended the annual sports day of Adani International School. NDTV Sports Desk Updated: February 04, 2025 12:20 pm IST Read Time: 2 min Adani International School hosted its annual sports day on January 31. Adani International School celebrated its annual sports day here on Friday with Indian pacer Ishant Sharma gracing the occasion as the chief guest. As many as 550 children took part in the school's annual sports day. An influential figure in Indian cricket, Sharma, who has spearheaded the nation's pace attack for over a decade, brought valuable experience and insights, which inspired the young athletes. Sharma has played 105 tests, 80 ODIs and 14 T20 tournaments and has 434 international wickets in his name. On Friday, Sharma interacted with the school students and encouraged them to pursue excellence in life. His on-field anecdotes made the day special for the students of Adani International School. \"I feel elated to have spent quality time with the kids, who are the future of our country. I'm sure they had a memorable day while putting on an encouraging display of sportsmanship. I would like to thank Adani International School for making me a part of this special day. It brought back fond memories for me and made me feel nostalgic,\" the 36-year-old cricketer said. Mr Sergio P, Head of School, Adani International School said, \"We were delighted to have a player of Ishant Sharma's stature grace our event. He has been part of numerous memorable wins for Indian cricket, and his presence further strengthened Adani Group's vision for sports. He has left a lasting impact by interacting with and inspiring these children and their parents. Our heartfelt thanks to Ishant, and we hope he had a great time at Adani International School.\" About Adani International School (Except for the headline, this story has not been edited by NDTV staff and is published from "
    },
    {
        "title": "China plans around 100 high-quality outdoor sports destinations",
        "link": "https://www.globaltimes.cn/page/202502/1327845.shtml",
        "content": "China plans around 100 high-quality outdoor sports destinations - Global Times ARTS / CULTURE & LEISURE China plans around 100 high-quality outdoor sports destinations By Sun Langchen Published: Feb 04, 2025 11:49 PM People enjoy skating at Longtan Park in Beijing on January 16, 2025. Photo: IC China plans to build around 100 high-quality outdoor sports destinations in order to promote the high-quality development of the outdoor sports industry, according to a circular jointly released by the National Development and Reform Commission and the General Administration of Sport re-cently, as reported by the People's Daily on Tuesday. By 2030, around 100 high-quality outdoor sports destinations with enhanced facilities, services, management and international influence will be built. It is an important measure to increase the number of outdoor sports participants and boost the outdoor sports industry so that it may become a new economic growth point, the circular said. The circular also stated that efforts should be made to utilize high-quality outdoor sports resources in a reasonable way, strengthen the construction of outdoor sports facilities, promote the upgrading of outdoor sports products and services, and improve the system of outdoor sports events. It further encourages regions with long snow season and high-quality snow in Northeast, North, and Northwest China to focus on developing winter sports. Northwest and Southwest China will act in supporting roles by fostering mountain-based outdoor activities, including trail running, rock climbing, and rafting. The growing enthusiasm for outdoor sports is already evident. Data from the General Administration of Sport shows that by the end of 2021, China had recorded over 400 million outdoor sports participants. The industry is trending toward mass participation, accessibility across all age groups, and a shift toward lighter and more social outdoor activities. Popular pursuits such as hiking, rock climbing, cycling, winter sports are expanding rapidly, attracting a younger demographic due to their low barrier of entry and social aspect. The 2025 Asian Winter Games will begin in Northeast China's Heilongjiang Province on Friday, bringing global attention to winter sports. Meanwhile, tourist enthusiasm in via ferrata climbing routes in East China's Zhejiang Province is also surging. In 2024, this newly introduced type of climbing routes at destinations such as Yandang Mountain were fully booked, with some requiring advance reservations, as reported by the People's Daily. \"These examples underscore the rapid development of outdoor sports,\" Luo Le, a Beijing-based sports scholar, told the Global Times on Tuesday. The circular also stressed the need to deeply integrate the outdoor sports industry with tourism, culture, health and education. Feasible means should be explored so that foreign capital can participate in the construction of high-quality outdoor sports destinations through sole proprietorships and joint ventures. \"This policy is primarily aimed at fostering outdoor sports development, marking a positive trajectory from late 2024 to 2025,\" Luo said. \"Encouraging people to participate in outdoor sports not only fulfills the intrinsic value of sports, but also highlights the unique appeal of outdoor activities - blending sports with tourism.\" He hailed the success of events like the Village Super League (VSL), which illustrates the power of sports-tourism synergy. \"It's not about high-level competition but about integrating tourism with activities like hiking and trekking to create an immersive experience,\" Luo said. Since 2023, community-level sporting competitions such as the Village Basketball Association, VSL, Village Volleyball, and dragon boat races have captivated people across the nation. Official data shows that in 2023 alone, over 246,000 community sports events were uploaded to the national fitness information platform, attracting more than 71.83 million participants, the Xinhua News Agency reported. The circular also underscores the importance of international cooperation in outdoor sports competitions. It calls for aligning domestic events with international standards, improving event infrastructure and organizational services, and attracting elite global athletes and teams. Additionally, it highlights the need to strengthen collaboration with BRI countries for outdoor sports events. \"Local tourism boards can also focus on attracting foreign tourists by creating internationally distinct outdoor sports destinations, which will broaden their appeal beyond domestic travelers,\" Luo suggested. In addition, safety management for outdoor sports should be enhanced, said the circular. Moving forward, the National Development and Reform Commission and the General Administration of Sport will work with relevant authorities to guide the planning, design, and construction of high-quality outdoor sports destinations. They will also coordinate efforts to mobil"
    }
]