[
    {
        "title": "PM Modi at Maha Kumbh Mela, takes holy dip at Triveni Sangam",
        "link": "https://www.thehindu.com/news/national/pm-modi-in-maha-kumbh-mela-prayagraj-triveni-sangam-holy-dip/article69182847.ece",
        "content": "PM Modi at Maha Kumbh Mela, takes holy dip at Triveni Sangam - The Hindu /> February 5, 2025 e-Paper LOGIN Account FREE TRIAL Subscribe GIFT FRONT PAGE Search Live Now Agriculture Books SECTION Books TOPICS Hindi Belt NEWSLETTER The Hindu On Books Books of the week, reviews, excerpts, new titles and features. SEE ALL NEWSLETTERS Business SECTION Business Agri-Business Economy Industry Markets Budget Children Cities SECTION Cities Bengaluru Chennai Coimbatore Delhi Hyderabad Kochi Kolkata Kozhikode Madurai Mangaluru Mumbai Puducherry Thiruvananthapuram Tiruchirapalli Vijayawada Visakhapatnam Data SECTION Data TOPICS Data Point Podcast NEWSLETTER Data Point Decoding the headlines with facts, figures, and numbers SEE ALL NEWSLETTERS Ebook Education SECTION Education Careers Colleges Schools Elections Entertainment SECTION Entertainment Art Dance Movies Music Reviews Theatre NEWSLETTER First Day First Show News and reviews from the world of cinema and streaming. SEE ALL NEWSLETTERS Environment Food SECTION Food Dining Features Guides Recipes TOPICS Good Health Hunting Health SECTION Health TOPICS Monkeypox NEWSLETTER Health Matters Ramya Kannan writes to you on getting to good health, and staying there SEE ALL NEWSLETTERS Life & Style SECTION Life & Style Fashion Fitness Homes and gardens Luxury Motoring Travel News SECTION News India World States Cities TOPICS Ground Zero Spotlight NEWSLETTER The View From India Looking at World Affairs from the Indian perspective. SEE ALL NEWSLETTERS Opinion SECTION Opinion Editorial Cartoon Columns Comment Interview Lead Letters Open Page Corrections & Clarifications Real Estate Science SECTION Science TOPICS ISRO Question Corner NEWSLETTER Science For All The weekly newsletter from science writers takes the jargon out of science and puts the fun in! SEE ALL NEWSLETTERS Society SECTION Society Faith History & Culture Sport SECTION Sport Cricket Football Hockey Tennis Athletics Motorsport Races Other Sports TOPICS Between Wickets Specials States SECTION States Andhra Pradesh Karnataka Kerala Tamil Nadu Telangana Andaman and Nicobar Islands Arunachal Pradesh Assam Bihar Chandigarh Chhattisgarh Daman, Diu, Dadra and Nagar Haveli Goa Gujarat Haryana Himachal Pradesh Jammu and Kashmir Jharkhand Lakshadweep Ladakh Madhya Pradesh Maharashtra Manipur Meghalaya Mizoram Nagaland Odisha Other States Punjab Rajasthan Sikkim Tripura Uttar Pradesh Uttarakhand West Bengal TOPICS Decode Karnataka Focus Tamil Nadu NEWSLETTER Karnataka Today Your daily dose of news highlights from Karnataka SEE ALL NEWSLETTERS Technology SECTION Technology Gadgets Internet NEWSLETTER Today's Cache Your download of the top 5 technology stories of the day. SEE ALL NEWSLETTERS Visual Story Brandhub Connect with us February 5, 2025 e-Paper Search for topics, people, articles... India World Movies Sport Data Health Opinion Science Delhi Elections Premium Videos Podcast Photos Crossword Newsletter Events Lit for Life The Huddle Home News India Maha Kumbh: PM Modi takes holy dip at Sangam Copy link Email Facebook Twitter Telegram LinkedIn WhatsApp Reddit READ LATER Remove SEE ALL PRINT Watch: Modi visits Maha kumbh, takes holy dip at Sangam Dressed in a full-sleeve deep orange jersey and blue lowers, Mr. Modi held ‘rudraksh’ beads in his hands during the bathing ritual amid chants of mantras. Updated - February 05, 2025 12:52 pm IST - Mahakumbh Nagar PTI Prime Minister Narendra Modi on Wednesday (February 5, 2025) visited the Maha Kumbh Mela and took a holy dip at the Triveni Sangam. Maha Kumbh: A confluence of faith and culture Dressed in a full-sleeve deep orange jersey and blue lowers, Mr. Modi held ‘rudraksh’ beads in his hands during the bathing ritual amid chants of mantras. Prime Minister Narendra Modi takes dip at the Triveni Sangam | Photo Credit: X/@narendramodi The Prime Minister, who was wearing a ‘rudraksh’ necklace, offered prayers to the Sun and River Ganga. Mr. Modi took a boat ride from Arail Ghat to the Triveni Sangam -- the confluence of Ganga, Yamuna and the mythical Saraswati.He was accompanied by Chief Minister Yogi Adityanath. Chief Minister Yogi Adityanath accompanying Prime Minister Narendra Modi to the Triveni Sangam. | Photo Credit: PMO India Mr. Adityanath earlier welcomed the PM upon his arrival in Prayagraj. Two crore take ‘Amrit Snan’ on Basant Panchami without hitch at Maha Kumbh Being held after 12 years, the Maha Kumbh started on January 13 and will continue till February 26. It is considered among the holiest pilgrimages by Hindus The mega fair on the banks of the Sangam has been drawing millions of pilgrims from across India and the world. According to the Uttar Pradesh government, so far, over 38 crore pilgrims have visited the Maha Kumbh. Published - February 05, 2025 11:40 am IST Read Comments Copy link Email Facebook Twitter Telegram LinkedIn WhatsApp Reddit READ LATER Remove SEE ALL PRINT Related Topics Prime Minister Narendra Modi / Maha Kumbh Mela 2025 / Uttar Pradesh Top N"
    },
    {
        "title": "\"Kumbh Stampede Victims' Bodies Thrown In River\": Jaya Bachchan Sparks Row",
        "link": "https://www.ndtv.com/india-news/maha-kumbh-mela-prayagraj-uttar-pradesh-news-holy-dip-stampede-water-quality-jaya-bachchan-7625667",
        "content": "\"Kumbh Stampede Victims' Bodies Thrown In River\": Jaya Bachchan Sparks Row arrow-down comments printer search bell top-nav right-arrow NDTV World Profit हिंदी Sports MOVIES FOOD LIFESTYLE HEALTH SWASTH TECH Games Big Bonus SHOPPING APPS Advertisement Live TV Latest India India All India News India Global Diaspora South Latest Arvind Kejriwal Goes To Vote With Family, Parents In Wheelchairs Centre Asks Employees To Avoid AI Tools Like ChatGPT, DeepSeek: Report 5 More Cheetahs To Be Released At Kuno National Park Today Mumbai To Have A Giant Ferris Wheel Inspired By The Iconic London Eye \"Indians Justifiably Outraged\": Bryan Johnson Slams India's Air Quality Again Elections World Cities Metros Bengaluru Chennai Delhi Mumbai Other Cities Ahmedabad Allahabad Amritsar Bhopal Bhubaneshwar Chandigarh Ghaziabad Goa Gurgaon Guwahati Hyderabad Jaipur Kanpur Kolkata Lucknow Noida Patna Pune Srinagar Thiruvananthapuram Opinion Videos India@AI Auto Education Education Exams School Campus Study Abroad Web Stories Latest JEE Main 2025: Check Last Date To Raise Objections Against Answer Key NEET UG 2025 Registrations May Begin This Week CA Results 2025: Chartered Accountancy Foundation Results Expected Soon AI Literacy Identified As Top Skill For Competitiveness In Job Market: Report JEE Main 2025 Session 1: Provisional Answer Key Released, Check What's Next Offbeat Web Stories Science Trends Photos Feature People TV Schedule Login Switch To Dark/Light Mode Trending Tags Latest News World News PNR Status Education News Business News Sports News MP Chhattisgarh News Rajasthan News Latest Mobile Phones Trending Committed To Closer Ties With India, Says Justin Trudeau Amid Row In Avoiding Repeat Of Telangana, BJP Pays Price In Tamil Nadu Man Complains Of Stomach Pain For Years, Doctors Find This Inside His Body \"They Can Speak For...\": US On India's Response On Canada's Allegations \"Kumbh Stampede Victims' Bodies Thrown In River\": Jaya Bachchan Sparks Row facebook twitter WhatsApp comments Settings Change Font Size A A Focus on Story Edition INDIA World Search here Get App for Better Experience Get it on Google Play Download on the App Store News Updates Live TV India Latest Video Profit Movies Cricket Cities Featured Elections Notifications Opinion Web Stories Trends Feature More Links Offbeat Science People South Education Tech Food Sports Health Lifestyle Photos TV Schedule Big Bonus Shopping Toolbox Follow Us On Facebook Twitter Instagram LinkedIn YouTube search olympic crypto_icon News India News \"Kumbh Stampede Victims' Bodies Thrown In River\": Jaya Bachchan Sparks Row \"Kumbh Stampede Victims' Bodies Thrown In River\": Jaya Bachchan Sparks Row Speaking to reporters outside Parliament, Ms Bachchan said: \"Where is the water most contaminated right now? It is in Kumbh.\" Edited by: Liu Chuen Chen India News Feb 03, 2025 20:09 pm IST Published On Feb 03, 2025 19:41 pm IST Last Updated On Feb 03, 2025 20:09 pm IST Read Time: 4 mins Share Twitter WhatsApp Facebook Reddit Email Samajwadi Party MP Jaya Bachchan. New Delhi: Samajwadi Party MP Jaya Bachchan on Monday stoked controversy through her remarks that the Ganga water in Uttar Pradesh's Prayagraj, where thousands of people are taking a dip during the ongoing Maha Kumbh, is allegedly highly contaminated as bodies of those killed in the recent stampede were dumped in the river. Ms Bachchan, a Rajya Sabha MP, dismissed the Yogi Adityanath government's claims that crores of people have participated in the Maha Kumbh, one of the largest religious gatherings in the world. She also demanded that the government provide actual figures on the deaths that took place during the stampede. A sacred event for Hindus, the Maha Kumbh began on January 13 and will conclude on February 26. On January 29, at least 30 people were killed when a huge crowd broke barricades and jostled for space to take a holy dip at the Sangam - the confluence of the Ganga, Yamuna and mythical Saraswati - during \"Amrit Snan\" on the occasion of Mauni Amavasya. Speaking to reporters outside Parliament, Ms Bachchan said: \"Where is the water most contaminated right now? It is in Kumbh. No one is giving any clarification on that. Bodies (of those who died in the stampede) have been thrown in the river because of which the water has been contaminated... This is the water which is being used by the people there. No one is giving any clarification on this.\" She added: \"The real issues of the country are not being addressed. People who do not get any VIP treatment, the common man, no arrangement has been made for them.\" Asked what it is that she was seeking from the state government, the actor-politician said: \"At least tell us the truth about what happened at Kumbh. They (government) should speak about it in Parliament.\" #WATCH | Delhi: Samajwadi Party MP Jaya Bachchan says, \"... Where is the water most contaminated right now? It's in Kumbh. Bodies (of those who died in the stampede) have been thrown in the river because "
    },
    {
        "title": "Exclusive! I return home from Maha Kumbh with mixed emotions, says Namish Taneja",
        "link": "https://timesofindia.indiatimes.com/tv/news/hindi/exclusive-i-return-home-from-maha-kumbh-with-mixed-emotions-says-namish-taneja/articleshow/117941057.cms",
        "content": "Exclusive! I return home from Maha Kumbh with mixed emotions, says Namish Taneja | - The Times of India Sign In TOI Go to TOI Etimes TOI Games Delhi Elections 2025 Budget 2025 Videos City Metro Cities mumbai delhi bengaluru Hyderabad kolkata chennai Other Cities City agra agartala ahmedabad ajmer amaravati amritsar bareilly bhubaneswar bhopal chandigarh chhatrapati sambhajinagar coimbatore cuttack dehradun erode faridabad ghaziabad goa gurgaon guwahati hubballi imphal indore itanagar jaipur jammu jamshedpur jodhpur kanpur kochi kohima kolhapur kozhikode ludhiana lucknow madurai mangaluru meerut mumbai region mysuru nagpur nashik navi mumbai noida patna prayagraj puducherry pune raipur rajkot ranchi thane salem shillong shimla srinagar surat trichy thiruvananthapuram udaipur vadodara varanasi vijayawada visakhapatnam photos Web Stories India featured Maha Kumbh Mela 2025 Times Evoke Maharashtra Delhi Karnataka Tamil Nadu Telangana Uttar Pradesh West Bengal Gujarat Madhya Pradesh Bihar Chandigarh Rajasthan Arunachal Pradesh Andhra Pradesh Assam Chhattisgarh Goa Haryana Himachal Pradesh Jammu Kashmir Jharkhand Kerala Manipur Meghalaya Mizoram Nagaland Odisha Punjab Sikkim Tripura Uttarakhand Andaman Nicobar Islands Dadra Nagar Haveli Daman Diu Lakshadweep Pondicherry Web Stories Saving Our Stripes Digital Arrest World Business Tech Cricket Sports Entertainment Astro TV Web Series Life & Style Education Photos Blogs News Exclusive! I return home from Maha Kumbh with mixed emotions, says Namish Taneja Exclusive! I return home from Maha Kumbh with mixed emotions, says Namish Taneja Akash Wadhwa / TNN / Feb 5, 2025, 12:59 IST Share AA + Text Size Small Medium Large The Aye Mere Humsafar actor Namish Taneja was recently in Prayaraj to participate in the Shahi Snan at the Maha Kumbh Namish Taneja taking a holy dip in Ganga at the Sangam in Prayagraj during the ongoing Maha Kumbh Actor Namish Taneja , for whom visiting this Maha Kumbh was on top of his wish list, says he wasn’t sure if that would work out because of professional commitments. “Recently, I was almost finalized for a show and was even supposed to shoot the promo. Since actors often work around the clock, I thought I wouldn’t be able to visit the Maha Kumbh though not during the Shahi Snan. However, destiny had other plans. While the show didn’t work out, I was given the incredible opportunity to take a Shahi Snan ,” says Namish, adding, “My father was a deeply spiritual soul, and if he were alive, he would have definitely visited Prayagraj . This was more of a reason for me to go for Maha Kumbh.” Namish Taneja taking a holy dip in Ganga at the Sangam in Prayagraj during the ongoing Maha Kumbh Namish Taneja taking a holy dip in Ganga at the Sangam in Prayagraj during the ongoing Maha Kumbh Telling us about the experience at Kumbh, the Mishri actor shared. “My mother, sister and I took a flight from Mumbai to Lucknow, then travelled to Phaphamau by road. From there, we took a train to Naini Bridge. The train was overcrowded, and the doors were locked from the inside. Thankfully, with the help of two police inspectors, Ram Kishore and Amit Kumar, we managed to board. The place where the tragic stampede occurred on Mauni Amavasya was the exact spot where we had initially planned to take the holy dip. However, upon seeing the overwhelming crowd, we decided to perform our snan at another ghat. Later, we learned about the devastating incident. But overall my visit to the Maha Kumbh was overwhelming, and I return home with mixed emotions.” Namish Taneja taking a holy dip in Ganga at the Sangam in Prayagraj during the ongoing Maha Kumbh Namish also managed to spend some time in Lucknow while going back to Mumbai. “Before heading back, I visited Hazratganj to buy Lakhnawi chikan outfits for my loved ones. Then, I explored Chatori Gali to indulge in delicious food. I enjoyed the basket chaat and I must say the food in Lucknow is so incredible that I’m already craving another visit.” About the Author Akash Wadhwa Akash Wadhwa is a senior copy editor-cum-correspondent at Lucknow Times. He handles the \"Lucknow Is Talking About\" and \"Allahabad Is Talking About\" pages, and also does Bollywood and TV reporting, as well as lifestyle and local reporting from Lucknow. He is an ardent television viewer. Read More End of Article FOLLOW US ON SOCIAL MEDIA Visual Stories Previous Ankita Lokhande’s top 10 designer ethnic looks tv Canada's 8 most beautiful national parks for nature lovers travel 10 foods to avoid if you have PCOS Lifestyle Rashmika Mandanna exudes regal elegance in red Entertainment ​Nayanthara's physical transformation over the years​ Entertainment The top 5 smartest zodiac signs you should know astrology 7 common phrases bosses use to manipulate employees Lifestyle 10 egg breakfast recipes for a nutritious start of the day Food Here's how much the 'Vidaamuyarchi' team is getting paid Entertainment Next 1 2 3 Photostories National parks in India that are perfec"
    },
    {
        "title": "PM Modi Takes Holy Dip At Maha Kumbh 2025",
        "link": "https://www.news18.com/web-stories/news/pm-modi-takes-holy-dip-at-maha-kumbh-2025-2808763/",
        "content": "PM Modi Takes Holy Dip At Maha Kumbh 2025 PM Modi Takes Holy Dip At Maha Kumbh 2025 Producer: Bhaswati Sengupta February 5, 2025 Prime Minister Narendra Modi visited the Maha Kumbh Mela in Prayagraj on February 5. Image: ANI/ X After reaching the fair venue, the Prime Minister took a boat ride to Triveni Sangam with Uttar Pradesh Chief Minister Yogi Adityanath. Image: ANI/ X PM Modi took a holy dip at Triveni Sangam, the confluence of three rivers- the Ganga, the Yamuna, and the mythical Saraswati. Image: ANI/ X The Prime Minister prayed to Maa Ganga in saffron jackets and track pants. Image: ANI/ X He chanted mantras holding ‘rudrakasha’ beads as he offered prayers standing knee-deep in the river. Image: ANI/ X PM Narendra Modi also performed Aarti at Triveni Sangam in Prayagraj, Uttar Pradesh. Image: ANI/ X The Prime Minister’s visit comes on February 5, when election is underway in the national capital. Image: ANI/ X Maha Kumbh began on Paush Purnima (January 13) and is the world largest spiritual and cultural gathering. NEXT: PM Modi Takes Holy Dip At Maha Kumbh, Says ‘Snan In Sangam Is…’"
    },
    {
        "title": "A spiritual journey: Bhutan king explores Maha Kumbh's significance at Prayagraj; see photos",
        "link": "https://timesofindia.indiatimes.com/city/allahabad/a-spiritual-journey-bhutan-king-explores-maha-kumbhs-significance-at-prayagraj-see-photos/photostory/117941280.cms",
        "content": "A spiritual journey: Bhutan king explores Maha Kumbh's significance at Prayagraj; see photos Edition IN IN US Sign In TOI City prayagraj mumbai delhi bengaluru Hyderabad kolkata chennai agra agartala ahmedabad ajmer amaravati amritsar bareilly bhubaneswar bhopal chandigarh chhatrapati sambhajinagar coimbatore cuttack dehradun erode faridabad ghaziabad goa gurgaon guwahati hubballi imphal indore itanagar jaipur jammu jamshedpur jodhpur kanpur kochi kohima kolhapur kozhikode ludhiana lucknow madurai mangaluru meerut mumbai region mysuru nagpur nashik navi mumbai noida patna puducherry pune raipur rajkot ranchi thane salem shillong shimla srinagar surat trichy thiruvananthapuram udaipur vadodara varanasi vijayawada visakhapatnam photos Web Stories Today's ePaper up elections weather News City News prayagraj News A spiritual journey: Bhutan king explores Maha Kumbh's significance at Prayagraj; see photos Trending MLA Amanatullah Khan Delhi BJP Candidates List Maha Kumbh Monalisa Bhosle Chennai Trio Sexual Assault Bengaluru Thief Arrested MLA Amanatullah Khan Delhi BJP Candidates List Maha Kumbh Monalisa Bhosle Chennai Trio Sexual Assault Bengaluru Thief Arrested MLA Amanatullah Khan Delhi BJP Candidates List Maha Kumbh Monalisa Bhosle Chennai Trio Sexual Assault Bengaluru Thief Arrested A spiritual journey: Bhutan king explores Maha Kumbh's significance at Prayagraj; see photos Updated: Feb 5, 2025, 13:18 IST Share AA + Text Size Small Medium Large Follow us 1 / 10 On PM's invitation Bhutan's King, Jigme Khesar Namgyel Wangchuck, makes a special visit to India to attend the Maha Kumbh Mela at the invitation of Prime Minister Narendra Modi, the MEA states. 2 / 10 Warm welcome at Bamrauli Mayor Umesh Kesarwani welcomes King Wangchuck and CM Yogi at Bamrauli airport, presenting a Sangam memento to the King of Bhutan. 3 / 10 Holy dip at Sangam Bhutan King Jigme Khesar and CM Yogi Adityanath take a sacred dip at Triveni Sangam on Tuesday, awed by the grand spiritual gathering. 4 / 10 UP governor hosts dinner During the Bhutanese King's visit, Uttar Pradesh Governor Anandiben Patel hosts a dinner in his honor. 5 / 10 Offering prayers to rivers CM briefs the Bhutanese King on Maha Kumbh's significance, and together they offer prayers to the Ganga, Yamuna, and mythical Saraswati. 6 / 10 Strengthening Indo-Bhutan ties The Bhutanese King's visit strengthens cultural and diplomatic ties between the nations, attended by leaders like Satyendra Dev Singh, Nand Gopal Gupta 'Nandi', and Jagadguru Santosh Das (Satua Baba). 7 / 10 Traditional to saffron attire Upon landing at the airport in Bhutan's traditional attire, Wangchuck switches to a long saffron kurta and pyjama before stepping into the waters. 8 / 10 Bhutan King embarks on sojourn Bhutan's King, Jigme Khesar Namgyel Wangchuck, arrived in the state capital on Monday, received a warm welcome from the Chief Minister, and then traveled to Sangam City for a spiritual ritual. 9 / 10 Temple visit After the dip, the Bhutan King visits the sacred Akshayvat, a symbol of eternity in Hinduism, and Bade Hanuman Temple to offer prayers. 10 / 10 Exploring digital Maha Kumbh CM Yogi and Bhutan's King Wangchuck visit the Digital Mahakumbh Experience Centre at Maha Kumbh Mela, Prayagraj. FOLLOW US ON SOCIAL MEDIA Visual Stories Previous Ankita Lokhande’s top 10 designer ethnic looks india Canada's 8 most beautiful national parks for nature lovers travel 10 foods to avoid if you have PCOS india Rashmika Mandanna exudes regal elegance in red india ​Nayanthara's physical transformation over the years​ india The top 5 smartest zodiac signs you should know india 7 common phrases bosses use to manipulate employees india 10 egg breakfast recipes for a nutritious start of the day Food Here's how much the 'Vidaamuyarchi' team is getting paid india Next 1 2 3 Bigg Boss BB 18: Arfeen calls out makers after Karan wins the show Bigg Boss 18 fame Chum gets a heartwarming welcome Bigg Boss 18 Grand Finale: Major highlights from the show BB 18: Karan shares heartwarming pic with mom and sister Bigg Boss 18 Grand Finale highlights: KVM wins BB18 Winner: Karan Veer Mehra lifts the trophy BB18: Vivian Dsena emerges as the first runner-up BB18: Aamir says 'Salman we should do Andaz Apna Apna 2' BB18: Rajat Dalal becomes the second runner-up 1 2 3 Photostories National parks in India that are perfect to visit with friends 4 Reasons why Raw Papaya Juice is a must in this season 5 common desi foods that can silently increase sugar levels 5 fruits that can help in hair growth ​5 yoga asanas that can stimulate hair growth​ From high-end car collection to net worth, luxurious house and more: Lavish lifestyle of Shark Tank India’s Ashneer Grover From Pamela Anderson to Ankita Lokhande: A look at the highest-paid contestants in Bigg Boss 9 tiny habits that can boost memory and increase retention power 7 habits to help create long-lasting love and relationships 1 2 3 Featured In City Delhi votes today: Homeless, t"
    }
]